app/controllers/authentication_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "test@test.test"], ["LIMIT", 1]]
---
  def authenticate_user
    user = User.find_for_database_authentication(email: params[:email])