app/controllers/produits_controller.rb

INSERT INTO "produits" ("nom", "quantite", "description", "prix", "fournisseur_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @fournisseur.produits.create!(produit_params)

UPDATE "produits" SET "nom" = ?, "quantite" = ?, "description" = ?, "prix" = ?, "updated_at" = ? WHERE "produits"."id" = ?  [["nom", "Produit 02"], ["quantite", 10], ["description", "desc"], ["prix", 1.0], ["updated_at", "2018-02-24 20:13:20.597964"], ["id", 1]]
---
  def update
    @produit.update(produit_params)

DELETE FROM "produits" WHERE "produits"."id" = ?  [["id", 1]]
---
  def destroy
    @produit.destroy

SELECT  "fournisseurs".* FROM "fournisseurs" WHERE "fournisseurs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_fournisseur
    @fournisseur = Fournisseur.find(params[:fournisseur_id])

SELECT  "produits".* FROM "produits" WHERE "produits"."fournisseur_id" = ? AND "produits"."id" = ? LIMIT ?  [["fournisseur_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def set_fournisseur_produit
    @produit = @fournisseur.produits.find_by!(id: params[:id]) if @fournisseur